第二周DAY02
主要任务：数组与字符串：一维/二维数组、C 风格字符数组、std::string 的 length/substr/find/+=。
预计练习：写"输入 10 个数求最大/最小/平均"；洛谷 入门4·数组 第 1–5 题

1.洛谷P1047 校门外的树https://www.luogu.com.cn/problem/P1047#ide
注：对于有范围的遍历循环for(int a:num)这种写法如果函数内有对元素的数值修改则无法在函数外体现，因为本质上将数组num中的元素复制了一遍，函数内修改的是复印件。如果想要实现修改原件则需要加引用，即for(int &a:num)；
    可以不用二维数组，可以用for(int i=0;i<m;i++)一行行输入后先遍历让他们=0（被砍掉）然后再i++进行下一行，先遍历的范围就可以丢弃掉，不用存入二维数组占内存。
    对于数组的初始化，比如num[100]={0};这个意思不是把数组内100个元素都初始化为0，就是初始化第一个元素为0，后面没初始化的元素补0，所以这个表达式的最终结果是数组num中所有元素为0；同样的arr[5]={1,3};这个意思也是把数组arr的前两个元素初始化为1，3，后面的元素自动补0，即arr[5]被初始化为{1，3，0，0，0}。
