第二周DAY01
主要任务：函数：定义/声明/参数/返回值、值传递 vs 引用传递、默认参数、函数重载、递归入门。
预计练习：手写 5 个函数：素数判断 / 最大公约数 / 字符串反转 / 数组求和 / 阶乘(递归)。

1.洛谷P5705 数字反转https://www.luogu.com.cn/problem/P5705#ide
注：可以输入字符串，然后反向遍历输出；
    也可以用reverse()函数将两头对调，最前面的和最后的调换，然后往里进格，一直换到中间，与sort()函数相同，区间是左闭右开的；
    reverse(s.begin(), s.end())                                       与sort()函数都包含在头文件<algorithm>中
            ↑ 第一个字符  ↑ 最后一个字符的后一格

2.洛谷P5706 再分肥宅水https://www.luogu.com.cn/problem/P5706#ide
注：如果设置了cout<<fixef<<setprecision(3)<<a;此时该对浮点数的设置会一直保留在cout中，但如果输出的是int整型就不受影响，如果要取消对浮点数的设置，可以用cout.unsetf(ios::fixed);     // 老写法，任何编译器都认   或者    cout << defaultfloat;        // C++11 起，洛谷可用；Dev-C++ 老版本可能报错

3.洛谷P5708 三角形面积https://www.luogu.com.cn/problem/P5708#ide
注：开根号用sqrt()函数，包含在头文件<cmath>中

4.洛谷P5707 上学迟到https://www.luogu.com.cn/problem/P5707#ide
注：一旦遇到“循环”、“周期”、“绕回”第一反应应该是%取模。此题的24小时制也是如此，如果所需时间大于8小时，8减去所需时间就会得到负数，那么就要倒回前一天，先用结果对24取余再加上一个循环让结果变成正数，就能得到最后的时间。同时，所需时间也有可能小于8小时，那么8减去所需时间就是正数，再加上一个循环就会超出循环范围，所以最后要再对24取余来消除这种情况的影响。
   强制类型转换的先后顺序：如果有int s,v;想要的浮点数s/v，就要先让其中一个数变成浮点数再除，例如double result=(double)s/v;最终才会是正确的结果；如果先相除再转换成浮点数的话结果就会不准确，例如写成double result=（double)(s/v);结果是两个整型数相除得到整型数，再在整型数后小数点加0转换成浮点数。
   整数向上取整的方法：(a + b - 1) / b        // 通用写法       a / b + (a % b != 0)   // 不溢出写法
   如果a/b有小数部分，则结果+1，如果无小数部分，则取正常算术结果。通用写法就是给除数加上一个小于被除数的数，如果a/b有剩余，那么结果就会被+1；如果a/b没剩余，那么对于b-1就永远差1才能使得结果+1。但当a,b的取值范围过大，a+b就会溢出，所以会采取不溢出写法，a%b!=0在运算时为真会自动判为1，为假时判为0。
   setfill()和setw()函数都包含在头文件<iomanip>中，setfill()具有粘性，设置一次后会一直存在；而setw()不具粘性，只对他后一个输出有效。
   setfill()会根据你填的填充内容推到输出结构类型，而cout是字符流，输出的是字符，所以cout<<setfill(0)<<a;会报错，只有填cout<<setfill('0')<<a;才行。

5.找最大公约数
注：用for循环遍历太费时费力了，工程量大的时候容易卡死，可以用欧几里得法；
   考虑最大公约数都是整数，就算两个所求数有负数，求得的公约数也是正数；
   但是算之前如果所求的两个数存在负数，需要先把他们取相反数变成正数；
   取绝对值用的abs()函数是包含在头文件<cstdlib> 中的。
